Documents/ЛБ_УстановитьЛомбардыВОтделение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановитьЛомбардыВОтделение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ОтделенияЛомбардов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦентральныйЛомбард</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_УстановитьЛомбардыВОтделение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("Отделение", Отделение);  
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |ГДЕ
	               |	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Регистратор = &Регистратор";
	ТаблицаЛомбардов = Запрос.Выполнить().Выгрузить();
	
	Движения.ЛБ_ОтделенияЛомбардов.Записывать = Истина;  
	Для каждого стр Из ЭтотОбъект.Ломбарды Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", стр.Ломбард);
		СтрокиЛ = ТаблицаЛомбардов.НайтиСтроки(Отбор);  
		Если СтрокиЛ.Количество() = 0 Тогда
			Движение = Движения.ЛБ_ОтделенияЛомбардов.Добавить();
		    Движение.Период = Дата; 
			Движение.Ломбард = Стр.Ломбард;
			Движение.Отделение = ЭтотОбъект.Отделение; 
			Движение.Центральный = Стр.ЦентральныйЛомбард;
		КонецЕсли; 
	КонецЦикла;	
	
КонецПроцедуры
